In [1]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.drop(["PassengerId",'Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [6]:
target = df.Survived
inputs = df.drop('Survived',axis = 'columns')

In [7]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [8]:
inputs = pd.concat([inputs,dummies],axis = 'columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [10]:
inputs.drop('Sex',axis = 'columns',inplace = True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [11]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [12]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [15]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [27]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test =  train_test_split(inputs,target,test_size=0.2,random_state=22)

In [28]:
len(x_train)

712

In [29]:
len(x_test)

179

In [30]:
len(inputs)

891

In [31]:
x_train

     Pclass        Age      Fare  female  male
793       1  29.699118   30.6958       0     1
814       3  30.500000    8.0500       0     1
43        2   3.000000   41.5792       1     0
269       1  35.000000  135.6333       1     0
538       3  29.699118   14.5000       0     1
..      ...        ...       ...     ...   ...
358       3  29.699118    7.8792       1     0
356       1  22.000000   55.0000       1     0
812       2  35.000000   10.5000       0     1
132       3  47.000000   14.5000       1     0
885       3  39.000000   29.1250       1     0

[712 rows x 5 columns]

In [32]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [33]:
model.fit(x_train,y_train)

GaussianNB()

In [34]:
model.score(x_test,y_test)

0.7430167597765364

In [35]:
y_test[:10]

816    0
789    0
869    1
235    0
473    1
42     0
759    1
664    1
94     0
504    1
Name: Survived, dtype: int64

In [36]:
model.predict(x_test[:10])

array([1, 0, 0, 1, 1, 0, 1, 0, 0, 1], dtype=int64)

In [37]:
model.predict_proba(x_test[:10])

array([[3.52074108e-02, 9.64792589e-01],
       [7.86669002e-01, 2.13330998e-01],
       [9.80971551e-01, 1.90284489e-02],
       [3.86627214e-02, 9.61337279e-01],
       [1.68568338e-02, 9.83143166e-01],
       [9.90325152e-01, 9.67484759e-03],
       [1.08216751e-03, 9.98917832e-01],
       [9.88650819e-01, 1.13491807e-02],
       [9.87573109e-01, 1.24268909e-02],
       [8.09497095e-04, 9.99190503e-01]])